internal/src/main/java/com/sun/ts/tests/internal/implementation/sjsas/saaj/com/sun/xml/messaging/saaj/soap/soaptests/data/data.soapmsg

<?xml version="1.0" encoding="UTF-8"?>
<!--

    Copyright (c) 2018 Oracle and/or its affiliates. All rights reserved.

    This program and the accompanying materials are made available under the
    terms of the Eclipse Public License v. 2.0, which is available at
    http://www.eclipse.org/legal/epl-2.0.

    This Source Code may also be made available under the following Secondary
    Licenses when the conditions for such availability set forth in the
    Eclipse Public License v. 2.0 are satisfied: GNU General Public License,
    version 2 with the GNU Classpath Exception, which is available at
    https://www.gnu.org/software/classpath/license.html.

    SPDX-License-Identifier: EPL-2.0 OR GPL-2.0 WITH Classpath-exception-2.0

-->

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns0="http://headertestservice.org/types4" xmlns:ns1="http://headertestservice.org/HeaderTestDefs.wsdl">
  <env:Header>
    <ns0:ConfigHeaderRequest env:mustUnderstand="1">
      <message>Config Header</message>
      <testName>GoodOrderTestWithSoapHeaderAndMUTrue</testName>
    </ns0:ConfigHeaderRequest>
  </env:Header>
  <env:Body>
    <ns1:submitOrder>
      <ProductOrder>
        <item>
          <productName>Product-1</productName>
          <productCode>100</productCode>
          <quantity>10</quantity>
          <price>119</price>
        </item>
        <customerInfo>
          <creditcard>1201-4465-1567-9823</creditcard>
          <name>John Doe</name>
          <street>1 Network Drive</street>
          <city>Burlington</city>
          <state>Ma</state>
          <zip>01837</zip>
          <country>USA</country>
        </customerInfo>
      </ProductOrder>
    </ns1:submitOrder>
  </env:Body>
</env:Envelope>
